Revit 2024 API
FileSaveDialog Members
The FileSaveDialog type exposes the following members.
Constructors
Name | Description
FileSaveDialog
 Constructs a new instance of a File Save dialog.
Methods
Name | Description
Dispose |  (Inherited from FileDialog.)
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetSelectedModelPath
 Returns the selected file path chosen by the user.
 (Inherited from FileDialog.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
Show
 Shows the dialog using the stored settings.
 (Inherited from FileDialog.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
DefaultFilterEntry
 The default entry (from the filter) to be selected in the dialog.
 (Inherited from FileDialog.)
Filter
 The filter string representing a collection of extensions allowed by the dialog.
 (Inherited from FileDialog.)
InitialFileName
 The initial file name to be shown for this save operation.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from FileDialog.)
Title
 The title to show on the dialog.
 (Inherited from FileDialog.)
See Also
FileSaveDialog Class
Autodesk.Revit.UI Namespace